Model: "model_small"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================

ENCODER:

	input_2 (InputLayer)         [(None, 32, 32, 3)]       0         
	_________________________________________________________________
	conv2d_3 (Conv2D)            (None, 32, 32, 32)        896       
	_________________________________________________________________
	average_pooling2d_3 (Average (None, 16, 16, 32)        0         
	_________________________________________________________________
	conv2d_4 (Conv2D)            (None, 16, 16, 16)        4624      
	_________________________________________________________________
	average_pooling2d_4 (Average (None, 8, 8, 16)          0         

DECODER:
	_________________________________________________________________
	conv2d_transpose_4 (Conv2DTr (None, 8, 8, 16)          2320      
	_________________________________________________________________
	up_sampling2d_3 (UpSampling2 (None, 16, 16, 16)        0         
	_________________________________________________________________
	conv2d_transpose_5 (Conv2DTr (None, 16, 16, 32)        4640      
	_________________________________________________________________
	up_sampling2d_4 (UpSampling2 (None, 32, 32, 32)        0         
	_________________________________________________________________
	conv2d_transpose_6 (Conv2DTr (None, 32, 32, 3)         867       
=================================================================
Total params: 13,347
Trainable params: 13,347
Non-trainable params: 0
_________________________________________________________________
