Model: "model_big"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================

ENCODER:

	input_3 (InputLayer)         [(None, 32, 32, 3)]       0         
	_________________________________________________________________
	conv2d_5 (Conv2D)            (None, 32, 32, 32)        896       
	_________________________________________________________________
	conv2d_6 (Conv2D)            (None, 32, 32, 64)        18496     
	_________________________________________________________________
	average_pooling2d_5 (Average (None, 16, 16, 64)        0         
	_________________________________________________________________
	conv2d_7 (Conv2D)            (None, 16, 16, 32)        18464     
	_________________________________________________________________
	conv2d_8 (Conv2D)            (None, 16, 16, 16)        4624      

DECODER:
	_________________________________________________________________
	conv2d_transpose_7 (Conv2DTr (None, 16, 16, 32)        4640      
	_________________________________________________________________
	up_sampling2d_5 (UpSampling2 (None, 32, 32, 32)        0         
	_________________________________________________________________
	conv2d_transpose_8 (Conv2DTr (None, 32, 32, 64)        18496     
	_________________________________________________________________
	conv2d_transpose_9 (Conv2DTr (None, 32, 32, 32)        18464     
	_________________________________________________________________
	conv2d_transpose_10 (Conv2DT (None, 32, 32, 3)         867       
=================================================================
Total params: 84,947
Trainable params: 84,947
Non-trainable params: 0
_________________________________________________________________
