Model: "model_mini"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================

ENCODER:

	input_1 (InputLayer)         [(None, 32, 32, 3)]       0         
	_________________________________________________________________
	conv2d (Conv2D)              (None, 32, 32, 32)        896       
	_________________________________________________________________
	average_pooling2d (AveragePo (None, 16, 16, 32)        0         
	_________________________________________________________________
	conv2d_1 (Conv2D)            (None, 16, 16, 16)        4624      
	_________________________________________________________________
	average_pooling2d_1 (Average (None, 8, 8, 16)          0         
	_________________________________________________________________
	conv2d_2 (Conv2D)            (None, 8, 8, 16)          2320      
	_________________________________________________________________
	average_pooling2d_2 (Average (None, 4, 4, 16)          0         

DECODER:
	_________________________________________________________________
	conv2d_transpose (Conv2DTran (None, 4, 4, 16)          2320      
	_________________________________________________________________
	up_sampling2d (UpSampling2D) (None, 8, 8, 16)          0         
	_________________________________________________________________
	conv2d_transpose_1 (Conv2DTr (None, 8, 8, 32)          4640      
	_________________________________________________________________
	up_sampling2d_1 (UpSampling2 (None, 16, 16, 32)        0         
	_________________________________________________________________
	conv2d_transpose_2 (Conv2DTr (None, 16, 16, 16)        4624      
	_________________________________________________________________
	up_sampling2d_2 (UpSampling2 (None, 32, 32, 16)        0         
	_________________________________________________________________
	conv2d_transpose_3 (Conv2DTr (None, 32, 32, 3)         435       
=================================================================
Total params: 19,859
Trainable params: 19,859
Non-trainable params: 0
_________________________________________________________________
