Model: "model_huge"

	_________________________________________________________________
	Layer (type)                 Output Shape              Param #   
	=================================================================
	
ENCODER:

	input_57 (InputLayer)        [(None, 32, 32, 3)]       0         
	_________________________________________________________________
	conv2d_168 (Conv2D)          (None, 32, 32, 32)        896       
	_________________________________________________________________
	up_sampling2d_120 (UpSamplin (None, 64, 64, 32)        0         
	_________________________________________________________________
	conv2d_169 (Conv2D)          (None, 64, 64, 64)        18496     
	_________________________________________________________________
	average_pooling2d_120 (Avera (None, 32, 32, 64)        0         
	_________________________________________________________________
	conv2d_170 (Conv2D)          (None, 32, 32, 32)        18464     
	_________________________________________________________________
	average_pooling2d_121 (Avera (None, 16, 16, 32)        0         

DECODER:
	_________________________________________________________________
	up_sampling2d_121 (UpSamplin (None, 32, 32, 32)        0         
	_________________________________________________________________
	conv2d_transpose_208 (Conv2D (None, 32, 32, 64)        18496     
	_________________________________________________________________
	up_sampling2d_122 (UpSamplin (None, 64, 64, 64)        0         
	_________________________________________________________________
	conv2d_transpose_209 (Conv2D (None, 64, 64, 64)        36928     
	_________________________________________________________________
	average_pooling2d_122 (Avera (None, 32, 32, 64)        0         
	_________________________________________________________________
	conv2d_transpose_210 (Conv2D (None, 32, 32, 32)        18464     
	_________________________________________________________________
	conv2d_transpose_211 (Conv2D (None, 32, 32, 3)         867       
=================================================================
Total params: 112,611
Trainable params: 112,611
Non-trainable params: 0
_________________________________________________________________
